const agreementText = `
MilRoute 서비스 이용약관

제1조 (목적)

이 약관은 TP1팀(이하 “회사"라 함)이 운영하는 최적 경로 플랫폼(이하 “플랫폼"이라 함)에서 운영하는 경로 관련 서비스 “MilRoute" (이하 “서비스"라 함)을 이용함에 있어 “회사" 와 “이용자"의 권리, 의무 및 책임사항을 규정함을 목적으로 합니다.

※ [PC통신, 무선 등을 이용하는 경우에 대해서도 그 성질에 반하지 않는 한 이 약관을 준용합니다.

제2조 (용어의 정의)

본 약관에서 사용하는 용어의 정의는 다음과 같습니다.

“플랫폼" 이란 “이용자" 가 컴퓨터 등 정보통신설비를 이용하여 “서비스"를 이용할 수 있도록 “회사”가 제공하는 가상의 영업장을 말하며, 아울러 “플랫폼"을 운영하는 사업자의 의미로도 사용합니다.
“이용자" 란 “플랫폼"을 통하여 이 약관에 따라 제공하는 서비스를 받는 회원 및 비회원을 말합니다.
“회원"이라 함은 “플랫폼"에 회원등록을 한 자로서, 계속적으로 “플랫폼" 이 제공하는 서비스를 이용할 수 있는 자를 말합니다.
“비회원” 이라 함은 회원에 가입하지 않고 “플랫폼"이 제공하는 서비스를 이용하는 자를 말합니다.

제3조 (약관 등의 명시와 설명 및 개정)

“회사"는 이 약관의 내용과 상호 및 대표자 성명, 영업소 소재지 주소(소비자의 불만을 처리할 수 있는 곳의 주소를 포함), 전화번호, E-mail 주소, 사업자등록번호, 통신판매업 신고번호, 개인정보보호책임자 등을 “이용자”가 쉽게 알 수 있도록 “플랫폼"의 초기 서비스화면(전면)에 게시합니다. 다만, 약관의 내용은 “이용자"가 연결화면을 통하여 볼 수 있도록 할 수 있습니다.
"회사"는 [전자상거래 등에서의 소비자보호에 관한 법률], [약관의 규제에 관한 법률], [전자문서 및 전자거래기본법], [전자금융거래법], [전자서명법], [정보통신망이용촉진 및 정보보호 등에 관한 법률], [소비자기본법] 등 관련 법을 위배하지 않는 범위에서 이 약관을 개정할 수 있습니다.
“회사"가 약관을 개정할 경우에는 적용일자 및 개정사유를 명시하여 현행약관과 함께 E-mail 등으로 적용일자 7일 이전부터 적용일자 전일까지 공지합니다. 다만, “이용자" 에게 불리하게 약관내용을 변경하는 경우에는 최소한 30일 이상의 사전 유예기간을 두고 공지합니다. 이 경우 “회사" 는 개정 전 내용과 개정 후 내용을 “이용자" 가 알기 쉽도록 표시합니다. 단, 회원의 연락처 미기재, 변경 후 미수정 등으로 인하여 개별 통지가 어려운 경우 일괄 공지를 개별 통지로 간주합니다.
“회원" 은 변경된 약관에 동의하지 않을 권리가 있으며, 동의하지 않을 경우에는 서비스 이용을 중단하고 탈퇴할 수 있습니다.
“회원" 이 전 ④항에 따라 약관에 대한 반대의사를 표시하지 않고 “서비스" 를 이용한 경우에는 약관에 동의한 것으로 봅니다.
이 약관에서 정하지 아니한 사항과 이 약관의 해석에 관여하는 전자상거래 등에서의 소비자보호에 관한 법률, 약관의 규제 등에 관한 법률 및 관계법령 또는 상관례에 따릅니다.

제4조 (회원가입)

“이용자" 는 “플랫폼" 이 정한 절차에 따라 이 약관에 동의한다는 의사표시를 함으로서 회원가입을 신청합니다.
“회사" 는 제①항과 같이 회원으로 가입할 것을 신청한 “이용자" 중 다음 각 호에 해당되지 않는 한 회원으로 등록합니다.

* 회원자격 상실 후 24시간이 경과하지 않는 경우
등록 내용에 타인의 정보를 사용한 경우

* 만 14세 미만의 아동이 신청하는 경우
본 약관 22조 “이용자" 의 의무를 지키지않아 회원자격이 제한되거나, 상실된 경우
회원가입계약의 성립 시기는 “회사" 의 승낙이 회원에게 도달한 시점으로 합니다.
회원은 회원가입 시 등록한 사항에 변경이 있는 경우, 상당한 기간 이내에 “플랫폼" 에 대하여 회원정보 수정하거나 E-mail 등의 방법으로 그 변경사항을 알려야 합니다.
“회사" 는 관련법령에 따라 필요한 경우 별도의 성인인증 절차를 실시할 수 있습니다.
제5조 (회원 탈퇴 및 자격 상실 등)

회원은 “회사" 에 언제든지 탈퇴를 요청할 수 있으며 “회사" 는 신속하게 회원탈퇴를 처리합니다.

회원이 다음 각 호의 사유에 해당하는 경우, “플랫폼" 은 회원자격을 제한 및 정지시킬 수 있습니다.

* 가입 신청 시에 허위 내용을 등록한 경우
다른 사람의 “플랫폼" 이용을 방해하거나 그 정보를 도용하는 등 전자상거래 질서를 위협하는 경우
“플랫폼" 을 이용하여 법령 또는 이 약관이 금지하거나 공서양속에 반하는 행위를 하는 경우
본 약관 제 22조에 따른 “이용자" 의 의무를 지키지 아니하였을 경우
“회사" 가 회원 자격을 제한, 정지 시킨 후, 같은 행위가 2회 이상 반복되거나 30일 이내에 그 사유가 시정되지 아니하는 경우 “회사" 는 회원자격을 상실시킬 수 있습니다.
회사는 회원이 계속해서 12개월 이상 로그인하지 않는 경우, 회원정보의 보호 및 운영의 효율성을 위해 이용을 제한할 수 있습니다.
본 조의 이용제한 범위 내에서 제한의 조건 및 세부내용은 회사의 이용제한정책에서 정하는 바에 의합니다.
본 조에 따라 서비스 이용을 제한하거나 계약을 해지하는 경우에는 회사는 제6조 [회원에 대한 통지] 에 따라 통지합니다.
회원은 본 조에 따른 이용제한 등에 대해 회사가 정한 절차에 따라 이의신청을 할 수 있습니다. 이 때 이의가 정당하다고 회사가 인정하는 경우 회사는 즉시 서비스의 이용을 재개합니다.

제6조 (회원에 대한 통지)

“회사" 가 회원에 대한 통지를 하는 경우, 회원이 “회사" 에게 제공한 E-mail, SMS와 APP 메시지, 알람톡 등의 기타 수단으로 통지할 수 있습니다.
“회사" 는 불특정다수 회원에 대한 통지의 경우 1주일 이상 “플랫폼" 게시판에 게시함으로써 개별 통지에 갈음할 수 있습니다. 다만, 회원 본인의 거래와 관련하여 중대한 영향을 미치는 사항에 대하여는 개별 통지합니다.

제7조 (서비스의 제공 및 변경)

“플랫폼" 은 다음과 같은 업무를 수행합니다.
시설에 대한 정보 제공
서비스이용에 대한 청약 접수
구매 계약이 체결된 서비스에 대한 통지
기타 “플랫폼" 이 정하는 업무

“플랫폼" 이 “이용자" 에게 접수한 청약에 대한 변경 내용 및 제휴판매자와 계약을 체결한 서비스의 내용을 재화 등의 품절 또는 기술적 사양의 변경 등의 사유로 변경할 경우에는 그 사유를 “이용자" 에게 통지 가능한 연락처로 신속하게 통지합니다.
이용자는 이용신청시 기재한 사항이 변경되었을 경우에는 수정하여야 하며, 수정하지 아니하여 발생하는 문제의 책임은 이용자에게 있습니다.

제8조 (서비스의 이용시간 및 중단)

“플랫폼" 의 이용은 특별한 사유가 없는 한 연중무휴 1일 24시간을 원칙으로 합니다. 다만, 컴퓨터 등 정보통신설비의 보수점검, 교체 및 고장, 통신의 두절 등의 사유 또는 정기점검 등의 필요로 “회사" 가 지정한 날 등의 경우에는 “플랫폼" 을 일시적으로 중단할 수 있습니다.
“회사" 는 “플랫폼" 의 원활한 운영을 위하여 기간을 정하여 사전에 고지하고 서비스를 중지할 수 있으며, 불가피하게 긴급한 조치를 하여야 하는 경우 사후에 통지할 수 있습니다.
고객센터 운영시간은 아래와 같이 규정합니다.

MilRoute 고객센터 운영시간 : 평일 오전 10시 00분 ~ 오후 06시 00분 (점심시간 오후 1시부터 오후 2시 제외, 주말 및 공휴일 제외)

고객센터 이용불가 시간에는 Kakao > 친구목록 ‘MilRoute' 에서 문의를 받고 있으며 순차적으로 답변이 진행됩니다.

제9조 (서비스이용 및 개인정보 제공 동의 등)

“이용자" 는 “플랫폼" 상에서 다음 또는 이와 유사한 방법에 의하여 서비스를 이용하며, “플랫폼” 은 “이용자" 가 서비스를 이용을 함에 있어서 다음의 각 내용을 알기 쉽게 제공하여야 합니다.

제10조 (개인정보보호)

“회사" 는 “이용자" 의 개인정보 수집 시 서비스제공을 위하여 필요한 범위에서 최소한의 개인정보를 수집합니다.
“회사" 는 회원가입 시 서비스에 필요한 정보를 미리 수집하지 않습니다. 다만, 관련 법령상 의무이행을 위하여 서비스이용 이전에 본인확인이 필요한 경우로서 최소한의 특정 개인정보를 수집하는 경우에는 그러하지 아니합니다.

“회사" 는 “이용자" 의 개인정보를 수집・이용하는 때에는 당해 “이용자" 에게 그 목적을 고지하고 동의를 받습니다.

“회사" 는 수집된 개인정보를 목적 외의 용도로 이용할 수 없으며, 새로운 이용목적이 발생한 경우 또는 제3자에게 제공하는 경우에는 이용・제공단계에서 당해 “이용자" 에게 그 목적을 고지하고 동의를 받습니다. 다만, 관련 법령에 달리 정함이 있는 경우에는 예외로 합니다.

“플랫폼" 이 제②항과 제③항에 의해 “이용자" 의 동의를 받아야 하는 경우에는 정보의 수집목적 및 이용목적, 제3자에 대한 정보제공 관련사항(제공받은 자, 제공목적 및 제공할 정보의 내용) 등 [정보통신망 이용촉진 및 정보보호 등에 관한 법률] 제22조 제1항이 규정한 사항을 미리 명시하거나 고지해야 하며 “이용자" 는 언제든지 이 동의를 철회할 수 있습니다.
“이용자" 는 언제든지 “플랫폼" 이 가지고 있는 자신의 개인정보에 대해 열람 및 오류정정을 요구할 수 있으며 “플랫폼" 은 이에 대해 지체 없이 필요한 조치를 취할 의무를 집니다. “이용자" 가 오류의 정정을 요구한 경우에는 “플랫폼" 은 그 오류를 정정할 때까지 당해 개인정보를 이용하지 않습니다.

“플랫폼" 은 개인정보 보호를 위하여 “이용자" 의 개인정보를 처리하는 자를 최소한으로 제한하여야 하며 신용카드, 은행계좌 등을 포함한 “이용자" 의 개인정보의 분실, 도난, 유출, 동의 없는 제3자 제공, 변조 등으로 인한 “이용자" 의 손해에 대하여 모든 책임을 집니다.
“플랫폼" 또는 그로부터 개인정보를 제공받은 제3자는 개인정보의 수집목적 또는 제공받은 목적을 달성할 때에는 당해 개인정보를 지체 없이 파기합니다.

“플랫폼" 은 개인정보의 수집・이용・제공에 관한 동의 란을 미리 선택한 것으로 설정해두지 않습니다. 또한 개인정보의 수집・이용・제공에 관한 “이용자" 의 동의거절 시 제한되는 서비스를 구체적으로 명시하고, 필수수집항목이 아닌 개인정보의 수집・이용・제공에 관한 “이용자" 의 동의 거절을 이유로 회원가입 등 서비스 제공을 제한하거나 거절하지 않습니다.

제11조 (회사의 의무)

“회사" 는 법령과 이 약관이 금지하거나 공서양속에 반하는 행위를 하지 않으며 이 약관이 정하는 바에 따라 지속적이고, 안정적인 서비스를 제공하는데 최선을 다하여야 합니다.
“회사" 는 “이용자" 가 안전하게 서비스를 이용할 수 있도록, “이용자" 의 개인정보(신용정보 포함)보호를 위한 보안 시스템을 갖추어야 합니다.
“회사" 는 이외에 관계 법령이 정한 의무사항을 준수합니다.

제12조 (회원의 ID 및 비밀번호에 대한 의무)

ID와 비밀번호에 관한 관리책임은 회원에게 있습니다.
“회원" 은 자신의 ID 및 비밀번호를 제3자에게 이용하게 해서는 안됩니다.
“회원" 이 자신의 ID 및 비밀번호를 도난당하거나 제3자가 사용하고 잇음을 인지한 경우에는 바로 “회사" 에 통보하고 “회사" 의 안내가 있는 경우에는 그에 따라야 합니다.
“회원" 이 제3항에 따른 통지를 하지 않거나 “회사" 의 조치에 따르지 않아 발생하는 모든 불이익에 대한 책임은 “회원" 에게 있습니다.

제22조 (이용자의 의무)

이용자는 다음 행위를 하여서는 안되며, 적발 시 회원탈퇴 등의 조치를 받을 수 있으며, 경우에 따라 경고, 일시정지, 영구이용정지 등으로 서비스 이용을 단계적으로 제한하는 조치를 받을 수 있습니다.

신청 또는 변경시 허위 내용의 등록
타인의 정보 도용
“플랫폼" 에 게시된 정보의 변경
“플랫폼" 이 정한 정보 이외의 정보(컴퓨터 프로그램 등) 등의 송신 또는 게시
“플랫폼" 및 기타 제3자의 저작권 등 지적재산권에 대한 침해
“플랫폼" 및 기타 제3자의 명예를 손상시키거나 업무를 방해하는 행위
외설 또는 폭력적인 메시지, 화상, 음성, 기타 공서양속에 반하는 정보를 “플랫폼" 에 공개 또는 게시하는 행위
“이용자" 본인에게 제공된 쿠폰을 타인에게 판매하거나 양도하는 행위
고객센터 상담 내용이 욕설, 폭언, 성희롱 등에 해당하는 행위
확인되지 않은 허위의 게시물을 작성하는 행위
정당한 사유 없이 “회사" 의 영업을 방해하는 내용을 기재하는 행위
리버스엔지니어링, 디컴파일, 디스어셈블 및 기타 일체의 가공행위를 통하여 서비스를 복제, 분해 또는 모방 기타 변형하는 행위
자동 접속 프로그램 등을 사용하는 등 정상적인 용법과 다른 방법으로 서비스를 이용하여 “회사" 의 서버에 부하를 일으켜 “회사" 의 정상적인 서비스를 방해하는 행위
기타 관계법령에 위반된다고 판단되는 행위

제 23조 (정보의 제공 및 광고의 기재)

회사는 서비스를 운영함에 있어 회사 또는 제휴사의 서비스 관련 각종 광고를 서비스 화면에 게재하거나 회원의 동의를 얻어 E-mail 및 서신우편, SMS(MMS), TM(telemarketing), app push 등의 방법으로 회원에게 제공할 수 있습니다.
회원이 서비스상에 게재되어 있는 광고를 이용하거나 서비스를 통한 광고주의 판촉활동에 참여하는 등의 방법으로 교신 또는 거래를 하는 것은 전적으로 회원과 광고주 간의 문제 입니다. 회원과 광고주간에 분쟁, 기타 문제가 발생하는 경우 회원과 광고주가 직접 해결하여야 하며, 이와 관련하여 회사는 귀책사유가 없는 한 책임도 지지 않습니다.

제24조 (“플랫폼" 과 연결된 “사이트" 와의 관계)

“플랫폼" 과 연결된 “사이트" 란 하이퍼링크(예: 하이퍼링크의 대상에는 문자, 그림 및 동화상 등이 포함됨) 방식 등으로 연결된 경우를 말합니다.

“플랫폼" 과 연결된 “사이트" 가 독자적으로 제공하는 재화 등에 의하여 “이용자" 와 행하는 거래에 대해서 보증 책임을 지지 않는다는 뜻을 “플랫폼" 의 초기화면 또는 연결되는 시점의 팝업화면으로 명시한 경우에는 그 거래에 대한 보증 책임을 지지 않습니다.
“플랫폼" 에서 제공되는 서비스 외에 “플랫폼" 과 단순한 링크로 연결되어 제3자가 제공하는 서비스에 대하여는 “회사" 의 개인정보처리방침이 적용되지 않으며 “회사" 는 제3자의 사이트에 대하여 책임지지 않습니다.

본 사이트 서비스와 관련하여 궁금하신 사항이 있으시다면 언제든지 고객센터(대표번호 : 1234-1234 / 운영시간: 10시 00분 ~ 18시 00분) 또는 카카오채널 @MilRoute 고객센터로 문의 주시기 바랍니다.

제27조 (재판권 및 준거법)

“회사" 와 “이용자" 간에 발생한 분쟁에 관한 소송은 “회사" 의 주소지를 관할하는 법원을 관할법원으로 정합니다.
“플랫폼" 과 “이용자" 간에 제기된 전자상거래 소송에는 한국법을 적용합니다.
부칙 (시행일)

본 약관은 2023년 7월 9일부터 적용합니다.

`;

export default agreementText;
